# Ultralytics YOLO MobileNetV4-Conv-Small
nc: 1 # number of classes
scales:
  n: [0.33, 0.25, 1024] # Nano scaling for Pi Zero

# MobileNetV4-Conv-Small Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]]  # 1-P2/4
  - [-1, 1, Conv, [64, 3, 1]]  # 2
  - [-1, 1, Conv, [128, 3, 2]] # 3-P3/8
  - [-1, 2, C2f, [128]]        # 4
  - [-1, 1, Conv, [256, 3, 2]] # 5-P4/16
  - [-1, 4, C2f, [256]]        # 6
  - [-1, 1, Conv, [512, 3, 2]] # 7-P5/32
  - [-1, 2, C2f, [512]]        # 8
  - [-1, 1, SPPF, [512, 5]]    # 9

# YOLO Head (Lightweight)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, C2f, [256]]        # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 2, C2f, [128]]        # 15 (P3/8-small)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 2, C2f, [256]]        # 18 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 2, C2f, [512]]        # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)