# Ultralytics YOLO MobileNetV4-Conv-Medium
nc: 1 # number of classes
scales:
  m: [0.67, 0.75, 1024] # Medium scaling factors

# MobileNetV4-Medium Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [48, 3, 2]]  # 0-P1/2 (Increased from 32)
  - [-1, 1, Conv, [96, 3, 2]]  # 1-P2/4 (Increased from 64)
  - [-1, 2, C2f, [96]]         # 2
  - [-1, 1, Conv, [192, 3, 2]] # 3-P3/8
  - [-1, 4, C2f, [192]]        # 4 (Deeper)
  - [-1, 1, Conv, [384, 3, 2]] # 5-P4/16
  - [-1, 8, C2f, [384]]        # 6 (Heavily repeated for features)
  - [-1, 1, Conv, [768, 3, 2]] # 7-P5/32
  - [-1, 4, C2f, [768]]        # 8
  - [-1, 1, SPPF, [768, 5]]    # 9

# YOLO Head (Scaled for Medium Backbone)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 4, C2f, [384]]        # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 4, C2f, [192]]        # 15 (P3/8)

  - [-1, 1, Conv, [192, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 4, C2f, [384]]        # 18 (P4/16)

  - [-1, 1, Conv, [384, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 4, C2f, [768]]        # 21 (P5/32)

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)